zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_crypto.c
/***************************************************************************//**
* \file cy_crypto.c
* \version 2.150.1
*
* \brief
*  Provides API implementation of the Infineon PDL Crypto driver.
*
********************************************************************************
* \copyright
* (c) 2020-2026, Infineon Technologies AG or an affiliate of
* Infineon Technologies AG.
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include "cy_device.h"

#if defined (CY_IP_MXCRYPTO)

#include "cy_crypto.h"

#if defined(__cplusplus)
extern "C" {
#endif

#include "cy_ipc_drv.h"
#include "cy_sysint.h"
#include "cy_syslib.h"

/*
 * The global variable to store a pointer to the customer's defined context.
 * This variable is global because it is accessed from an interrupt.
 */
static cy_stc_crypto_context_t *clientContext = NULL;

static void Cy_Crypto_Client_ReleaseIntrHndlr(void);
static bool Cy_Crypto_IsServerStarted(cy_stc_crypto_context_t const *context);
static bool Cy_Crypto_IsServerReady(cy_stc_crypto_context_t const *context);
static cy_en_crypto_status_t Cy_Crypto_Client_Send(void);

/*******************************************************************************
* Function Name: Cy_Crypto_Client_ReleaseIntrHndlr
****************************************************************************//**
*
* The interrupt handler for the Crypto IPC Release interrupt; happens
* when Crypto hardware completes operation. This function clears the specific
* interrupt source and calls the customer interrupt handler.
*
* This function is internal and should not to be called directly by user software
*
*******************************************************************************/
static void Cy_Crypto_Client_ReleaseIntrHndlr(void)
{
    uint32_t interruptMasked;

    interruptMasked = Cy_IPC_Drv_ExtractReleaseMask(Cy_IPC_Drv_GetInterruptStatusMasked(Cy_IPC_Drv_GetIntrBaseAddr(clientContext->releaseNotifierChannel)));

    /* Check that there is really the IPC Crypto Release interrupt */
    if((1uL << clientContext->ipcChannel) == interruptMasked)
    {
        Cy_IPC_Drv_ClearInterrupt(Cy_IPC_Drv_GetIntrBaseAddr(clientContext->releaseNotifierChannel),
                                                        interruptMasked, CY_IPC_NO_NOTIFICATION);

        if (clientContext->userCompleteCallback != NULL)
        {
            (clientContext->userCompleteCallback)();
        }
    }
}

/*******************************************************************************
* Function Name: Cy_Crypto_IsServerStarted
****************************************************************************//**
*
* Checks whether the CryptoServer is started.
*
* This function is internal and should not to be called directly by user software
*
* \param context
* The pointer to the \ref cy_stc_crypto_context_t structure that stores
* the Crypto server context.
*
* \return
* True  - CryptoServer is started.
* False - CryptoServer is not started.
*
*******************************************************************************/
static bool Cy_Crypto_IsServerStarted(cy_stc_crypto_context_t const *context)
{
    /* Check whether the CryptoServer is started (Crypto IPC Notify interrupt is started) */
    return ((1uL << (context->ipcChannel)) ==
        Cy_IPC_Drv_ExtractAcquireMask(Cy_IPC_Drv_GetInterruptMask(Cy_IPC_Drv_GetIntrBaseAddr(context->acquireNotifierChannel))));
}

/*******************************************************************************
* Function Name: Cy_Crypto_IsServerReady
****************************************************************************//**
*
* Checks whether the CryptoServer is ready for operations.
*
* This function is internal and should not to be called directly by user software.
*
* \param context
* The pointer to the \ref cy_stc_crypto_context_t structure that stores
* the Crypto server context.
*
* \return
* True  - CryptoServer is ready.
* False - CryptoServer is not ready.
*
*******************************************************************************/
static bool Cy_Crypto_IsServerReady(cy_stc_crypto_context_t const *context)
{
    return (!Cy_IPC_Drv_IsLockAcquired(Cy_IPC_Drv_GetIpcBaseAddress(context->ipcChannel)));
}

cy_en_crypto_status_t Cy_Crypto_Sync(bool isBlocking)
{
    cy_en_crypto_status_t status = CY_CRYPTO_NOT_INITIALIZED;

    if (NULL != clientContext)
    {
        if (CY_CRYPTO_INSTR_UNKNOWN != clientContext->instr)
        {
            status = CY_CRYPTO_SERVER_NOT_STARTED;

            /* Check if the Crypto server started (Crypto IPC Notify interrupt is started) */
            if (Cy_Crypto_IsServerStarted(clientContext))
            {

                if (!isBlocking)
                {
                    status = CY_CRYPTO_SERVER_BUSY;

                    if (Cy_Crypto_IsServerReady(clientContext))
                    {
                        status = clientContext->resp;
                    }
                }
                else
                {
                    while (!Cy_Crypto_IsServerReady(clientContext))
                    {
                    }
                    status = clientContext->resp;
                }
            }
        }
    }

    return (status);
}

/*******************************************************************************
* Function Name: Cy_Crypto_Client_Send
****************************************************************************//**
*
* This function sends a pointer to the Crypto Server.
*
* This function is internal and should not to be called directly by user software.
*
* \return
* \ref cy_en_crypto_status_t
*
*******************************************************************************/
static cy_en_crypto_status_t Cy_Crypto_Client_Send(void)
{
    cy_en_crypto_status_t status = CY_CRYPTO_SERVER_NOT_STARTED;

    if (Cy_Crypto_IsServerStarted(clientContext))
    {
        status = CY_CRYPTO_SERVER_BUSY;

        if (Cy_Crypto_IsServerReady(clientContext))
        {
            status = CY_CRYPTO_SUCCESS;

            if (CY_IPC_DRV_SUCCESS != Cy_IPC_Drv_SendMsgPtr(Cy_IPC_Drv_GetIpcBaseAddress(clientContext->ipcChannel), (1uL << clientContext->acquireNotifierChannel), clientContext))
            {
                status = CY_CRYPTO_COMM_FAIL;
            }
        }
    }

    return (status);
}

cy_en_crypto_status_t Cy_Crypto_GetErrorStatus(cy_stc_crypto_hw_error_t *hwErrorCause)
{
    if(NULL != hwErrorCause)
    {
        hwErrorCause->errorStatus0 = clientContext->hwErrorStatus.errorStatus0;
        hwErrorCause->errorStatus1 = clientContext->hwErrorStatus.errorStatus1;
    }

    return (clientContext->resp);
}

